swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Processing.c
/***************************************************************************//**
* \file CapSense_1_Processing.c
* \version 3.0
*
* \brief
*   This file provides the source code for the Data Processing module APIs
*   of the Component. The Data Processing module is responsible for the
*   low level raw counts processing provided by the sensing module, maintaining
*   baseline and difference values and performing high-level widget processing
*   like updating button status or calculating slider position.
*
* \see CapSense_1 v3.0 Datasheet
*
*//*****************************************************************************
* Copyright (2016-2017), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/

#include "syslib/cy_syslib.h"
#include <stddef.h>
#include <string.h>
#include "CapSense_1_Configuration.h"
#include "CapSense_1_Processing.h"
#include "CapSense_1_Filter.h"

#if (0u != CapSense_1_CENTROID_EN)
    #include "CapSense_1_Centroid_LL.h"
#endif /* (0 != CapSense_1_CENTROID_EN) */

#if (0 != (CapSense_1_CSD_AUTOTUNE & CapSense_1_CSD_SS_TH_EN))
    #include "CapSense_1_SmartSense_LL.h"
#endif /* (0 != (CapSense_1_CSD_AUTOTUNE & CapSense_1_CSD_SS_TH_EN)) */

#if (CapSense_1_ENABLE == CapSense_1_SELF_TEST_EN)
    #include "CapSense_1_SelfTest.h"
#endif

#if (CapSense_1_ENABLE == CapSense_1_CENTROID_5X5_CSD_EN)
    #include "CapSense_1_AdvancedCentroid_LL.h"
#endif

#if (CapSense_1_ENABLE == CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN)
    #include "CapSense_1_AdaptiveFilter_LL.h"
#endif

#if(CapSense_1_ENABLE == CapSense_1_BALLISTIC_MULTIPLIER_EN)
    #include "CapSense_1_Gesture.h"
#endif

/***********************************************************************************************************************
* Local definition
***********************************************************************************************************************/

/* UINT32 constant with all odd bits set. It is used by the processing function of the Proximity widget to
*  determine type of the status bit: odd bits report proximity status; even bits report touch status;
*/
#define UINT32_ODD_BITS_CONST       (0x55555555u)

/* Default value for the Off Debounce counter when the Off Debounce is disabled */
#define DEFAULT_OFF_DEBOUNCE_VALUE  (1u)
#define PERCENTAGE_100              (100u)
#define TEMP_BUFFER_MSB_SHIFT       (16)

/***********************************************************************************************************************
* Local variables
***********************************************************************************************************************/
#if (0u != CapSense_1_CSX_MULTIPHASE_TX_EN)
    static uint16 deconvRowData[CapSense_1_CSX_MAX_TX_PHASE_LENGTH];
#endif


/***********************************************************************************************************************
* Static Function Prototypes
***********************************************************************************************************************/
/**
* \cond SECTION_CYSENSE_INTERNAL
* \addtogroup group_cysense_internal
* \{
*/
#if (0u != CapSense_1_TOTAL_LINEAR_SLIDERS)
    __STATIC_INLINE void DpUpdateLinSlider(
                        const uint16 newPos[], uint32 numTouches,
                        CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt,
                        CapSense_1_RAM_WD_SLIDER_STRUCT *ptrRamWdgt);
#endif /* #if (0u != CapSense_1_TOTAL_LINEAR_SLIDERS) */

#if (0u != CapSense_1_TOTAL_RADIAL_SLIDERS)
    __STATIC_INLINE void DpUpdateRadSlider(
                        const uint16 newPos[], uint32 numTouches,
                        CapSense_1_FLASH_WD_STRUCT const * ptrFlashWdgt,
                        CapSense_1_RAM_WD_SLIDER_STRUCT *ptrRamWdgt);
#endif /* #if (0u != CapSense_1_TOTAL_RADIAL_SLIDERS) */

#if (0u != CapSense_1_CSD_TOUCHPAD_WIDGET_EN)
    __STATIC_INLINE void CapSense_1_DpInitCsdTouchpad(CapSense_1_FLASH_WD_STRUCT const * ptrFlashWdgt);
#endif /* #if (0u != CapSense_1_CSD_TOUCHPAD_WIDGET_EN) */

#if (0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN)
    __STATIC_INLINE void CapSense_1_DpInitCsxTouchpad(CapSense_1_FLASH_WD_STRUCT const * ptrFlashWdgt);
#endif /* #if (0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN) */

#if (0u != CapSense_1_SLIDER_WIDGET_EN)
    __STATIC_INLINE void CapSense_1_DpInitSlider(CapSense_1_FLASH_WD_STRUCT const * ptrFlashWdgt);
#endif /* #if (0u != CapSense_1_SLIDER_WIDGET_EN) */

#if (0u != CapSense_1_CSD_MATRIX_WIDGET_EN)
    __STATIC_INLINE void CapSense_1_DpInitCsdMatrix(CapSense_1_FLASH_WD_STRUCT const * ptrFlashWdgt);
#endif /* #if (0u != CapSense_1_CSD_MATRIX_WIDGET_EN) */

/** \}
* \endcond */

#if (0u != CapSense_1_CSD_TOUCHPAD_WIDGET_EN)
/*******************************************************************************
* Function Name: CapSense_1_DpInitCsdTouchpad
****************************************************************************//**
*
* \brief
*  Performs initialization of the CSD touchpad widget.
*   - Resets the position data to NONE
*   - Initializes the position filter history if enabled.
*
* \details
*  The position data is always reset to the CapSense_1_TOUCHPAD_POS_NONE value.
*  The same happens to the position filter history data if enabled.
*
*******************************************************************************/
__STATIC_INLINE void CapSense_1_DpInitCsdTouchpad(CapSense_1_FLASH_WD_STRUCT const * ptrFlashWdgt)
{
    #if (CapSense_1_ENABLE == CapSense_1_CENTROID_5X5_CSD_EN)
        uint32 touchIndex;
    #endif

    CapSense_1_RAM_WD_CSD_TOUCHPAD_STRUCT *ptrWdTouchpad;

