swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Processing.c
    #if (0u != CapSense_1_POSITION_FILTER_EN)
        CapSense_1_TOUCHPAD_POS_HISTORY_STRUCT *ptrHistory;
    #endif  /* #if (0u != CapSense_1_POSITION_FILTER_EN) */

    #if (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN)
        ADAPTIVE_FILTER_CONTEXT_STRUCT adpContext;
    #endif /* (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN) */

    ptrWdTouchpad = ptrFlashWdgt->ptr2WdgtRam;

    /* Reset position data */
    #if (CapSense_1_ENABLE == CapSense_1_CENTROID_5X5_CSD_EN)
        #if (CapSense_1_ENABLE == CapSense_1_CENTROID_3X3_CSD_EN)
            if (0u != (ptrFlashWdgt->staticConfig & CapSense_1_CENTROID_5X5_MASK))
            {
        #endif

        ptrWdTouchpad->position.touchNum = 0u;

        #if (0u != CapSense_1_POSITION_FILTER_EN)
            ptrHistory = ptrFlashWdgt->ptr2PosHistory;
        #endif /* (0u != CapSense_1_POSITION_FILTER_EN) */

        for (touchIndex = 0u; touchIndex < ADVANCED_CENTROID_MAX_TOUCHES; touchIndex++)
        {
            ptrWdTouchpad->position.pos[touchIndex].x = ADVANCED_CENTROID_POSITION_NONE;
            ptrWdTouchpad->position.pos[touchIndex].y = ADVANCED_CENTROID_POSITION_NONE;
            ptrWdTouchpad->position.pos[touchIndex].zX = ADVANCED_CENTROID_POSITION_NONE;
            ptrWdTouchpad->position.pos[touchIndex].zY = ADVANCED_CENTROID_POSITION_NONE;

            /* Clear position filter history data if available */
            #if (0u != CapSense_1_POSITION_FILTER_EN)
                if (NULL != ptrHistory)
                {
                    CapSense_1_InitPosFiltersDd(&ptrHistory[touchIndex], CapSense_1_TOUCHPAD_POS_NONE, CapSense_1_TOUCHPAD_POS_NONE);
                    #if (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN)
                        AdaptiveFilter_Initialize(&ptrWdTouchpad->aiirConfig, &adpContext);
                        ptrHistory[touchIndex].xPos.posAIIRCoeff = adpContext.coefficient;
                        ptrHistory[touchIndex].yPos.posAIIRCoeff = adpContext.coefficient;
                    #endif /* (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN) */
                }
            #endif /* (0u != CapSense_1_POSITION_FILTER_EN) */
        }

        #if (CapSense_1_ENABLE == CapSense_1_CENTROID_3X3_CSD_EN)
            }
        #endif
    #endif

    #if (CapSense_1_ENABLE == CapSense_1_CENTROID_3X3_CSD_EN)
        if (0u != (ptrFlashWdgt->staticConfig & CapSense_1_CENTROID_3X3_MASK))
        {
            ptrWdTouchpad->posX = CapSense_1_TOUCHPAD_POS_NONE;
            ptrWdTouchpad->posY = CapSense_1_TOUCHPAD_POS_NONE;

            /* Clear position filter history data if available */
            #if (0u != CapSense_1_POSITION_FILTER_EN)
                ptrHistory = ptrFlashWdgt->ptr2PosHistory;
                CapSense_1_InitPosFiltersDd(ptrHistory, CapSense_1_TOUCHPAD_POS_NONE, CapSense_1_TOUCHPAD_POS_NONE);

                #if (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN)
                    if (NULL != ptrHistory)
                    {
                        AdaptiveFilter_Initialize(&ptrWdTouchpad->aiirConfig, &adpContext);
                        ptrHistory->xPos.posAIIRCoeff = adpContext.coefficient;
                        ptrHistory->yPos.posAIIRCoeff = adpContext.coefficient;
                    }
                #endif /* (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN) */
            #endif /* (0u != CapSense_1_POSITION_FILTER_EN) */
        }
    #endif
}
#endif /* #if (0u != CapSense_1_CSD_TOUCHPAD_WIDGET_EN) */

#if (0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN)
/*******************************************************************************
* Function Name: CapSense_1_DpInitCsxTouchpad
****************************************************************************//**
*
* \brief
*  Performs initialization of the CSX touchpad widget i.e. Resets the position data to NONE.
*
* \details
*  The position data is always reset to the CapSense_1_TOUCHPAD_POS_NONE value.
*
*******************************************************************************/
__STATIC_INLINE void CapSense_1_DpInitCsxTouchpad(CapSense_1_FLASH_WD_STRUCT const * ptrFlashWdgt)
{
    CapSense_1_RAM_WD_CSX_TOUCHPAD_STRUCT *ptrWdTouchpad;

    #if (0u != CapSense_1_POSITION_FILTER_EN)
        uint32 touchIndex;
        CapSense_1_TOUCHPAD_POS_HISTORY_STRUCT *ptrHistory;
    #endif  /* #if (0u != CapSense_1_POSITION_FILTER_EN) */

    #if (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN)
        ADAPTIVE_FILTER_CONTEXT_STRUCT adpContext;
    #endif /* (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN) */

    ptrWdTouchpad = ptrFlashWdgt->ptr2WdgtRam;

    #if (0u != CapSense_1_POSITION_FILTER_EN)
        ptrHistory = ptrFlashWdgt->ptr2PosHistory;
    #endif /* (0u != CapSense_1_POSITION_FILTER_EN) */

    /* Reset position data for finger */
    ptrWdTouchpad->touch[0u].x = CapSense_1_TOUCHPAD_POS_NONE;
    ptrWdTouchpad->touch[0u].y = CapSense_1_TOUCHPAD_POS_NONE;
    ptrWdTouchpad->touch[0u].z = CY_LO8(CapSense_1_TOUCHPAD_POS_NONE);

    #if (CapSense_1_CSX_MAX_FINGERS > 1u)
        ptrWdTouchpad->touch[1u].x = CapSense_1_TOUCHPAD_POS_NONE;
        ptrWdTouchpad->touch[1u].y = CapSense_1_TOUCHPAD_POS_NONE;
        ptrWdTouchpad->touch[1u].z = CY_LO8(CapSense_1_TOUCHPAD_POS_NONE);
    #endif /* #if (CapSense_1_CSX_MAX_FINGERS > 1u) */

    #if (CapSense_1_CSX_MAX_FINGERS > 2u)
        ptrWdTouchpad->touch[2u].x = CapSense_1_TOUCHPAD_POS_NONE;
        ptrWdTouchpad->touch[2u].y = CapSense_1_TOUCHPAD_POS_NONE;
        ptrWdTouchpad->touch[2u].z = CY_LO8(CapSense_1_TOUCHPAD_POS_NONE);
    #endif /* #if (CapSense_1_CSX_MAX_FINGERS > 2u) */

    #if (0u != CapSense_1_POSITION_FILTER_EN)
        for (touchIndex = 0u; touchIndex < CapSense_1_CSX_MAX_FINGERS; touchIndex++)
        {
            if (NULL != ptrHistory)
            {
                /* Clear position filter history data if available */
                CapSense_1_InitPosFiltersDd(&ptrHistory[touchIndex], CapSense_1_TOUCHPAD_POS_NONE, CapSense_1_TOUCHPAD_POS_NONE);
                #if (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN)
                    AdaptiveFilter_Initialize(&ptrWdTouchpad->aiirConfig, &adpContext);
                    ptrHistory[touchIndex].xPos.posAIIRCoeff = adpContext.coefficient;
                    ptrHistory[touchIndex].yPos.posAIIRCoeff = adpContext.coefficient;
                #endif /* (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN) */
            }
        }
    #endif /* (0u != CapSense_1_POSITION_FILTER_EN) */
}
#endif /* #if (0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN) */

#if (0u != CapSense_1_SLIDER_WIDGET_EN)
/*******************************************************************************
* Function Name: CapSense_1_DpInitSlider
****************************************************************************//**
*
* \brief
*  Performs initialization of the Radial and Linear Slider widget.
*   - Resets the position data to NONE
*   - Initializes the position filter history to NONE if enabled.
*
* \details
*  Position data is always reset to the CapSense_1_SLIDER_POS_NONE value.
*  The same happens to the position filter history data if enabled.
*
*******************************************************************************/
__STATIC_INLINE void CapSense_1_DpInitSlider(CapSense_1_FLASH_WD_STRUCT const * ptrFlashWdgt)
{
    uint32 idx;
    CapSense_1_RAM_WD_SLIDER_STRUCT *ptrWdSlider;

