swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Processing.c
    #if (0u != CapSense_1_POSITION_FILTER_EN)
        CapSense_1_SLIDER_POS_HISTORY_STRUCT *ptrHistory;
    #endif /* #if (0u != CapSense_1_POSITION_FILTER_EN) */

    #if (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN)
        ADAPTIVE_FILTER_CONTEXT_STRUCT context;
    #endif /* (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN) */

    ptrWdSlider = ptrFlashWdgt->ptr2WdgtRam;

    /* Reset slider position data to NONE */
    for (idx = 0u; idx < CapSense_1_NUM_CENTROIDS; idx++)
    {
        ptrWdSlider->position[idx] = CapSense_1_SLIDER_POS_NONE;

        #if (0u != CapSense_1_POSITION_FILTER_EN)
            ptrHistory = ptrFlashWdgt->ptr2PosHistory;
            if (NULL != ptrHistory)
            {
                CapSense_1_InitPosFiltersSd(&ptrHistory[idx], CapSense_1_SLIDER_POS_NONE);
                #if (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN)
                    AdaptiveFilter_Initialize(&ptrWdSlider->aiirConfig, &context);
                    ptrHistory->posAIIRCoeff = context.coefficient;
                #endif /* (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN) */
            }

        #endif /* #if (0u != CapSense_1_POSITION_FILTER_EN) */
    }
}
#endif /* #if (0u != CapSense_1_SLIDER_WIDGET_EN) */

#if (0u != CapSense_1_CSD_MATRIX_WIDGET_EN)
/*******************************************************************************
* Function Name: CapSense_1_DpInitCsdMatrix
****************************************************************************//**
*
* \brief
*  Performs initialization of the CSD Matrix Buttons widget.
*   - Resets the active button position data to NONE.
*
* \details
*  Position data is always reset to the CapSense_1_MATRIX_POS_NONE value.
*
*******************************************************************************/
__STATIC_INLINE void CapSense_1_DpInitCsdMatrix(CapSense_1_FLASH_WD_STRUCT const * ptrFlashWdgt)
{
    CapSense_1_RAM_WD_CSD_MATRIX_STRUCT *ptrRamWdgt;

    ptrRamWdgt = (CapSense_1_RAM_WD_CSD_MATRIX_STRUCT *)ptrFlashWdgt->ptr2WdgtRam;

    /* Reset sensor id, row and col registers in data structure */
    ptrRamWdgt->posRow   = CapSense_1_MATRIX_POS_NONE;
    ptrRamWdgt->posCol   = CapSense_1_MATRIX_POS_NONE;
    ptrRamWdgt->posSnsId = CapSense_1_MATRIX_POS_NONE;
}
#endif /* #if (0u != CapSense_1_CSD_MATRIX_WIDGET_EN) */

/*******************************************************************************
* Function Name: CapSense_1_DpInitialize
****************************************************************************//**
*
* \brief
*  Performs initialization of the data processing FW module:
*   - Resets the de-bounce counters of all the widgets
*   - Resets the position filter history for slider and touchpad widgets
*   - Clears widget and sensor statuses
*   - Enables all the widgets.
*
* \details
*  The Button and Matrix Button widgets have individual de-bounce counter per
*  sensor for the CSD widgets and per node for the CSX widgets.
*
*  The Slider and Touchpad widgets have a single de-bounce counter per widget.
*
*  The Proximity widget has two de-bounce counters per sensor. One for the
*  proximity event and second for the touch event.
*
*  All debounce counters during initialization are set to the value of the
*  onDebounce widget parameter.
*
*******************************************************************************/
void CapSense_1_DpInitialize(void)
{
    uint32 wdgtId;
    CapSense_1_WD_TYPE_ENUM widgetType;
    CapSense_1_RAM_WD_BASE_STRUCT * ptrRamWdgt;
    CapSense_1_FLASH_WD_STRUCT const * ptrFlashWdgt;

    for (wdgtId = 0u; wdgtId < CapSense_1_WDGT_STATUS_WORDS; wdgtId++)
    {
        /* Clear widget status */
        CapSense_1_dsRam.wdgtStatus[wdgtId] = 0u;

        /* Enable all the widgets */
        CapSense_1_dsRam.wdgtEnable[wdgtId] = 0xFFFFFFFFLu;

        /* Set all the widgets to working state if the Self-Test is not enabled */
        #if (0u != CapSense_1_SELF_TEST_EN)
            CapSense_1_dsRam.wdgtWorking[wdgtId] = 0xFFFFFFFFLu;
        #endif /* #if (0u == CapSense_1_SELF_TEST_EN) */
    }

    ptrFlashWdgt = CapSense_1_dsFlash.wdgtArray;

    for (wdgtId = CapSense_1_TOTAL_WIDGETS; wdgtId-- > 0u; )
    {
        ptrRamWdgt = (CapSense_1_RAM_WD_BASE_STRUCT *)ptrFlashWdgt->ptr2WdgtRam;
        widgetType = (CapSense_1_WD_TYPE_ENUM)ptrFlashWdgt->wdgtType;

        /* Clear all sensor statuses */
        CapSense_1_dsRam.snsStatus[wdgtId] = 0u;

        /* Reset de-bounce counters */
        switch (widgetType)
        {
        #if (0u != CapSense_1_MATRIX_WIDGET_EN)
            case CapSense_1_WD_MATRIX_BUTTON_E:
                #if (0u != CapSense_1_CSD_MATRIX_WIDGET_EN)
                    if (CapSense_1_SENSE_METHOD_CSD_E == CapSense_1_GET_SENSE_METHOD(ptrFlashWdgt))
                    {
                        CapSense_1_DpInitCsdMatrix(ptrFlashWdgt);
                    }
                #endif /* #if (0u != CapSense_1_CSD_MATRIX_WIDGET_EN) */

                if (NULL != ptrFlashWdgt->ptr2DebounceArr)
                {
                    /* Initialize array of debounce counters */
                    (void)memset(ptrFlashWdgt->ptr2DebounceArr,
                                 (int32)ptrRamWdgt->onDebounce,
                                 (size_t)ptrFlashWdgt->totalNumSns);
                }
                break;
        #endif /* #if (0u != CapSense_1_MATRIX_WIDGET_EN) */

        #if (0u != CapSense_1_BUTTON_WIDGET_EN)
            case CapSense_1_WD_BUTTON_E:
                if (NULL != ptrFlashWdgt->ptr2DebounceArr)
                {
                    /* Initialize array of debounce counters */
                    (void)memset(ptrFlashWdgt->ptr2DebounceArr,
                                 (int32)ptrRamWdgt->onDebounce,
                                 (size_t)ptrFlashWdgt->totalNumSns);
                }
                break;
        #endif /* #if (0u != CapSense_1_BUTTON_WIDGET_EN) */

        #if (0u != CapSense_1_SLIDER_WIDGET_EN)
            case CapSense_1_WD_LINEAR_SLIDER_E:
            case CapSense_1_WD_RADIAL_SLIDER_E:
                if (NULL != ptrFlashWdgt->ptr2DebounceArr)
                {
                    /* Initialize single debounce counter of slider */
                    *(uint8 *)(ptrFlashWdgt->ptr2DebounceArr) = ptrRamWdgt->onDebounce;
                }

                CapSense_1_DpInitSlider(ptrFlashWdgt);

                break;
        #endif /* #if (0u != CapSense_1_SLIDER_WIDGET_EN) */

