swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Processing.c
        #if (0u != CapSense_1_TOUCHPAD_WIDGET_EN)
            case CapSense_1_WD_TOUCHPAD_E:
                if (NULL != ptrFlashWdgt->ptr2DebounceArr)
                {
                    /* Initialize single debounce counter of touchpad */
                    *(uint8 *)(ptrFlashWdgt->ptr2DebounceArr) = ptrRamWdgt->onDebounce;
                }

                #if (0u != CapSense_1_CSD_TOUCHPAD_WIDGET_EN)
                    if (CapSense_1_SENSE_METHOD_CSD_E == CapSense_1_GET_SENSE_METHOD(ptrFlashWdgt))
                    {
                        CapSense_1_DpInitCsdTouchpad(ptrFlashWdgt);
                    }
                #endif /* #if (0u != CapSense_1_CSD_TOUCHPAD_WIDGET_EN) */

                #if (0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN)
                    if (CapSense_1_SENSE_METHOD_CSX_E == CapSense_1_GET_SENSE_METHOD(ptrFlashWdgt))
                    {
                        CapSense_1_DpInitCsxTouchpad(ptrFlashWdgt);
                    }
                #endif /* #if (0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN) */

                break;
        #endif /* #if (0u != CapSense_1_TOUCHPAD_WIDGET_EN) */

        #if (0u != CapSense_1_PROXIMITY_WIDGET_EN)
            case CapSense_1_WD_PROXIMITY_E:
                if (NULL != ptrFlashWdgt->ptr2DebounceArr)
                {
                    /* Proximity widgets have 2 de-bounce counters per sensor.
                     * Therefore the number of sensors is multiplied by 2.
                     */
                   (void)memset(ptrFlashWdgt->ptr2DebounceArr,
                                (int32)ptrRamWdgt->onDebounce,
                                (size_t)ptrFlashWdgt->totalNumSns * 2u);
                }
                break;
        #endif /* #if (0u != CapSense_1_PROXIMITY_WIDGET_EN) */

            default:
                break;
        }

        /* Move to next widget */
        ptrFlashWdgt++;
    }
}

#if (0u != CapSense_1_TOTAL_CSX_WIDGETS)
/*******************************************************************************
* Function Name: CapSense_1_DpProcessCsxWidgetRawCounts
****************************************************************************//**
*
* \brief
*  Performs default processing of the CSX raw counts.
*
* \details
*  Performs default processing of the CSX raw counts:
*   - Run Filters
*   - Update Baselines
*   - Update Differences
*   - Update Status.
*  The same process is applied to all the sensors of the specified widget.
*
* \param ptrFlashWdgt The pointer to the Flash widget structure.
*
* \return
*  Returns the status of the specified widget processing operation:
*  - CY_RET_SUCCESS if operation was successfully completed;
*  - CapSense_1_PROCESS_BASELINE_FAILED if baseline processing of any
*    sensor of the specified widget failed. The result is concatenated with the index
*    of failed sensor.
*
*******************************************************************************/
uint32 CapSense_1_DpProcessCsxWidgetRawCounts(CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt)
{
    uint32 result = CY_RET_SUCCESS;
    uint32 widgetType;
    uint32 snsCount;
    CapSense_1_RAM_SNS_STRUCT *ptrSnsTmp;
    CapSense_1_RAM_WD_BASE_STRUCT *ptrRamWdgt;

    #if (CapSense_1_ENABLE == CapSense_1_RC_FILTER_EN)
        CapSense_1_PTR_FILTER_VARIANT fltrHistV;

        fltrHistV.ptr = ptrFlashWdgt->ptr2FltrHistory;
    #endif /* #if (CapSense_1_ENABLE == CapSense_1_RC_FILTER_EN) */

    ptrSnsTmp = ptrFlashWdgt->ptr2SnsRam;
    snsCount = ptrFlashWdgt->totalNumSns;
    ptrRamWdgt = (CapSense_1_RAM_WD_BASE_STRUCT *)ptrFlashWdgt->ptr2WdgtRam;
    widgetType = ptrFlashWdgt->wdgtType;

    /* Run deconvolution algorithm for the widgets with multiphase TX support */
    #if (0u != CapSense_1_CSX_MULTIPHASE_TX_EN)
        if (0u != (ptrFlashWdgt->staticConfig & CapSense_1_MULTIPHASE_TX_MASK))
        {
            CapSense_1_DpDeconvolution(ptrFlashWdgt);
        }
    #endif  /* #if (0u != CapSense_1_CSX_MULTIPHASE_TX_EN) */

    for (;snsCount-- > 0u;)
    {
        #if (CapSense_1_ENABLE == CapSense_1_RC_FILTER_EN)
            CapSense_1_FtRunEnabledFiltersInternal(fltrHistV, ptrSnsTmp, widgetType);
            #if (CapSense_1_ALP_FILTER_EN)
                CapSense_1_ConfigRunALPInternal(fltrHistV, ptrRamWdgt, ptrSnsTmp, widgetType);
            #endif
        #endif /* #if (CapSense_1_ENABLE == CapSense_1_RC_FILTER_EN) */

        result = CapSense_1_FtUpdateBaseline(ptrRamWdgt, ptrSnsTmp, widgetType);

        #if (CapSense_1_ENABLE == CapSense_1_TST_BSLN_DUPLICATION_EN)
            if (CY_RET_SUCCESS != result)
            {
                result = snsCount | CapSense_1_PROCESS_BASELINE_FAILED;
            }
        #endif /* (CapSense_1_ENABLE == CapSense_1_TST_BSLN_DUPLICATION_EN) */

        CapSense_1_DpUpdateDifferences(ptrRamWdgt, ptrSnsTmp);

        /* Move pointers to the next sensor and filter history objects */
        ptrSnsTmp++;
        
        #if (CapSense_1_ENABLE == CapSense_1_RC_FILTER_EN)
            CapSense_1_INC_REG_FLTR_OBJ(fltrHistV);
        #endif /* #if (CapSense_1_ENABLE == CapSense_1_RC_FILTER_EN) */
    }
    return result;
}

/*******************************************************************************
* Function Name: CapSense_1_DpProcessCsxSensorRawCountsExt
****************************************************************************//**
*
* \brief
*   Performs customized processing of the CSX sensor raw counts.
*
* \details
*   Performs customized processing of the CSX sensor raw counts.
*
*   If all bits are set at once the default processing order will take place.
*   For the custom order this API can be called multiple times and execute one task at a time.
*
* \param ptrFlashWdgt The pointer to the Flash Widget Object.
* \param curSnsPtr    The pointer to the specific RAM Sensor Object.
* \param fltrHistV    The pointer to the Filter History Object in RAM associated with specific sensor.
* \param mode         The bit-mask with the data processing tasks to be executed.
*   The mode parameters can take the following values:
*    - CapSense_1_PROCESS_FILTER     (0x01) Run Firmware Filter
*    - CapSense_1_PROCESS_BASELINE   (0x02) Update Baselines
*    - CapSense_1_PROCESS_DIFFCOUNTS (0x04) Update Difference Counts
*    - CapSense_1_PROCESS_ALL               Execute all tasks
*
* \return
*  Returns the status of the specified sensor processing operation:
*  - CY_RET_SUCCESS if operation was successfully completed;
*  - CapSense_1_PROCESS_BASELINE_FAILED if baseline processing of any
*    sensor of the specified widget failed. The result is concatenated with the index
*    of failed sensor.
*
*******************************************************************************/
uint32 CapSense_1_DpProcessCsxSensorRawCountsExt(
                CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt,
                CapSense_1_RAM_SNS_STRUCT *curSnsPtr,
                CapSense_1_PTR_FILTER_VARIANT fltrHistV,
                uint32 mode)
{
    uint32  result = CY_RET_SUCCESS;
    uint32  widgetType;
    CapSense_1_RAM_WD_BASE_STRUCT *ptrRamWdgt;

    widgetType = ptrFlashWdgt->wdgtType;
    ptrRamWdgt = (CapSense_1_RAM_WD_BASE_STRUCT *)ptrFlashWdgt->ptr2WdgtRam;

    #if (CapSense_1_ENABLE == CapSense_1_RC_FILTER_EN)
        if (0u != (mode & CapSense_1_PROCESS_FILTER))
        {
            CapSense_1_FtRunEnabledFiltersInternal(fltrHistV, curSnsPtr, widgetType);
            #if (CapSense_1_ALP_FILTER_EN)
                CapSense_1_ConfigRunALPInternal(fltrHistV, ptrRamWdgt, curSnsPtr, widgetType);
            #endif
        }
    #else
        (void)fltrHistV; /* This parameter is unused in such configurations */
    #endif /* #if (CapSense_1_ENABLE == CapSense_1_RC_FILTER_EN) */

    if (0u != (mode & CapSense_1_PROCESS_BASELINE))
    {
        result = CapSense_1_FtUpdateBaseline(ptrRamWdgt, curSnsPtr, widgetType);
    }

