swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Processing.c
    if (0u != (mode & CapSense_1_PROCESS_DIFFCOUNTS))
    {
        CapSense_1_DpUpdateDifferences(ptrRamWdgt, curSnsPtr);
    }
    return result;
}


/*******************************************************************************
* Function Name: CapSense_1_DpProcessCsxWidgetStatus
****************************************************************************//**
*
* \brief
*   Updates the status of the CSX widget in the Data Structure.
*
* \details
*  This API determines the type of widget and runs the appropriate function
*  that implements the status update algorithm for this type of widget.
*
*  When the widget-specific processing completes this API updates the snsStatus
*  and wdgtStatus registers in the data structure. The wdgtStatus register
*  is a bitmask were each bit corresponds to the specific widget identified by
*  the widget index. When the bit is set the widget is active (touched);
*
*  Depending on the type of widget the snsStatus register may contain either
*  status of each widget node (active/non-active) or in case of the CSX Touchpad
*  is contains the number of touches. In both cases 0 means that widget is not
*  active.
*
* \param widgetId     The widget ID number.
* \param ptrFlashWdgt The pointer to the Flash Widget Object.
*
*******************************************************************************/
void CapSense_1_DpProcessCsxWidgetStatus(uint32 widgetId, CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt)
{
    uint32 sensorStatus;
    uint32 wdStatusIndex;
    uint32 wdStatusMask;
    CapSense_1_WD_TYPE_ENUM widgetType;

    widgetType = (CapSense_1_WD_TYPE_ENUM)ptrFlashWdgt->wdgtType;
    sensorStatus = CapSense_1_dsRam.snsStatus[widgetId];

    switch (widgetType)
    {
    #if (0u != CapSense_1_BUTTON_WIDGET_EN)
        case CapSense_1_WD_BUTTON_E:
            sensorStatus = CapSense_1_DpProcessButton(sensorStatus, ptrFlashWdgt);
            break;
    #endif /* #if (0u != CapSense_1_BUTTON_WIDGET_EN) */

    #if (0u != CapSense_1_CSX_MATRIX_WIDGET_EN)
        case CapSense_1_WD_MATRIX_BUTTON_E:
            sensorStatus = CapSense_1_DpProcessButton(sensorStatus, ptrFlashWdgt);
            break;
    #endif /* #if (0u != CapSense_1_CSX_MATRIX_WIDGET_EN) */

    #if (0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN)
        case CapSense_1_WD_TOUCHPAD_E:
            sensorStatus = CapSense_1_DpProcessCsxTouchpad(sensorStatus, ptrFlashWdgt);
            break;
    #endif /* #if (0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN) */

    default:
        CY_ASSERT(0 != 0);
        break;
    }

    /* Update sensor status in the data structure */
    CapSense_1_dsRam.snsStatus[widgetId] = (CapSense_1_SNS_STS_TYPE)sensorStatus;

    /* The next two lines calculate index and bitmask of the widget status bit in the wdgtStatus array member */
    wdStatusIndex = CapSense_1_GET_WDGT_STATUS_INDEX(widgetId);
    wdStatusMask = CapSense_1_GET_WDGT_STATUS_MASK(widgetId);

    /* Check if there are active sensors and update widget status accordingly */
    if (0u == sensorStatus)
    {
        CapSense_1_dsRam.wdgtStatus[wdStatusIndex] &= ~wdStatusMask;
    }
    else
    {
        CapSense_1_dsRam.wdgtStatus[wdStatusIndex] |= wdStatusMask;
    }
}
#endif /* #if CapSense_1_TOTAL_CSX_WIDGETS */

#if (0u != CapSense_1_TOTAL_CSD_WIDGETS)
/*******************************************************************************
* Function Name: CapSense_1_DpProcessCsdWidgetRawCounts
****************************************************************************//**
*
* \brief
*   Performs default processing for the CSD widget raw counts.
*
* \details
*   Performs default processing for the CSD widget raw counts:
*    - Run Filters
*    - Update Thresholds (FW Auto-tuning)
*    - Update Baselines
*    - Update Differences.
*   The process is applied to all widget's sensors.
*
* \param ptrFlashWdgt The pointer to the Flash Widget Object.
*
* \return
*  Returns the status of the specified widget processing operation:
*  - CY_RET_SUCCESS if operation was successfully completed;
*  - CapSense_1_PROCESS_BASELINE_FAILED if baseline processing of any
*    sensor of the specified widget failed. The result is concatenated with the index
*    of failed sensor.
*
*******************************************************************************/
uint32 CapSense_1_DpProcessCsdWidgetRawCounts(CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt)
{
    uint32  result = CY_RET_SUCCESS;

    #if (CapSense_1_ENABLE == CapSense_1_TST_BSLN_DUPLICATION_EN)
        uint32 bslnTstResult = CY_RET_SUCCESS;
    #endif /* (CapSense_1_ENABLE == CapSense_1_TST_BSLN_DUPLICATION_EN) */

    uint32  widgetType;
    uint32  snsId;
    CapSense_1_RAM_SNS_STRUCT *ptrSnsTmp;
    CapSense_1_RAM_WD_BASE_STRUCT *ptrRamWdgt;

    #if (0u != (CapSense_1_CSD_AUTOTUNE & CapSense_1_CSD_SS_TH_EN))
        /* The noise envelope data is available only when Full CSD Auto-Tuning is enabled */
        SMARTSENSE_CSD_NOISE_ENVELOPE_STRUCT *ptrNoiseEnvelope;
        #if (CapSense_1_ENABLE == CapSense_1_PROXIMITY_WIDGET_EN)
            uint32  proximityThreshold;
        #endif /* (0 != CapSense_1_PROXIMITY_WIDGET_EN) */
    #endif /* #if (0u != (CapSense_1_CSD_AUTOTUNE & CapSense_1_CSD_SS_TH_EN)) */

    #if (CapSense_1_ENABLE == CapSense_1_RC_FILTER_EN)
        CapSense_1_PTR_FILTER_VARIANT fltrHistV;

        /* Determine if widget type is proximity */
        uint32 isProxWdgt = (CapSense_1_GET_WIDGET_TYPE(ptrFlashWdgt) == CapSense_1_WD_PROXIMITY_E) ? 1u : 0u;

        /* Get pointer to the filter history object */
        fltrHistV.ptr = ptrFlashWdgt->ptr2FltrHistory;
    #endif /* #if (CapSense_1_ENABLE == CapSense_1_RC_FILTER_EN) */

    ptrSnsTmp = ptrFlashWdgt->ptr2SnsRam;
    ptrRamWdgt = (CapSense_1_RAM_WD_BASE_STRUCT *)ptrFlashWdgt->ptr2WdgtRam;
    widgetType = ptrFlashWdgt->wdgtType;

    #if (0u != (CapSense_1_CSD_AUTOTUNE & CapSense_1_CSD_SS_TH_EN))
        ptrNoiseEnvelope = ptrFlashWdgt->ptr2NoiseEnvlp;
    #endif /* #if (0u != (CapSense_1_CSD_AUTOTUNE & CapSense_1_CSD_SS_TH_EN)) */

    /* Iterate through all widget's sensors */
    for(snsId = 0u; snsId < ptrFlashWdgt->totalNumSns; snsId++)
    {
        /* Run all enabled filter on specified widget's sensor */
        #if (CapSense_1_ENABLE == CapSense_1_RC_FILTER_EN)
            CapSense_1_FtRunEnabledFiltersInternal(fltrHistV, ptrSnsTmp, widgetType);
            #if (CapSense_1_ALP_FILTER_EN)
                CapSense_1_ConfigRunALPInternal(fltrHistV, ptrRamWdgt, ptrSnsTmp, widgetType);
            #endif
        #endif /* #if (CapSense_1_ENABLE == CapSense_1_RC_FILTER_EN) */

        /* Run auto-tuning activities */
        #if (0u != (CapSense_1_CSD_AUTOTUNE & CapSense_1_CSD_SS_TH_EN))
            SmartSense_RunNoiseEnvelope(ptrSnsTmp->raw[0u], ptrRamWdgt->sigPFC, ptrNoiseEnvelope);
            CapSense_1_DpUpdateThresholds(ptrRamWdgt, ptrNoiseEnvelope, snsId);

            /* Calculate Proximity Touch Threshold in SmartSense mode based on Finger Threshold and PROX_TOUCH_COEFF */
            #if (CapSense_1_ENABLE == CapSense_1_PROXIMITY_WIDGET_EN)
                if (CapSense_1_WD_PROXIMITY_E == CapSense_1_GET_WIDGET_TYPE(ptrFlashWdgt))
                {
                    proximityThreshold = ((uint32)ptrRamWdgt->fingerTh * CapSense_1_PROX_TOUCH_COEFF) / PERCENTAGE_100;
                    if ((((1Lu) << CapSense_1_THRESHOLD_SIZE) - 1u) < proximityThreshold)
                    {
                        proximityThreshold = ((1Lu) << CapSense_1_THRESHOLD_SIZE) - 1u;
                    }
                    ((CapSense_1_RAM_WD_PROXIMITY_STRUCT *)ptrFlashWdgt->ptr2WdgtRam)->proxTouchTh =
                        (CapSense_1_THRESHOLD_TYPE)proximityThreshold;
                }
            #endif /* (0 != CapSense_1_PROXIMITY_WIDGET_EN) */

            /* Move to next noise-envelope object */
            ptrNoiseEnvelope++;
        #endif /* (0u != (CapSense_1_CSD_AUTOTUNE & CapSense_1_CSD_SS_TH_EN)) */

        #if (CapSense_1_ENABLE == CapSense_1_TST_BSLN_DUPLICATION_EN)
            bslnTstResult = CapSense_1_FtUpdateBaseline(ptrRamWdgt, ptrSnsTmp, widgetType);
            if ((CY_RET_SUCCESS != bslnTstResult) && (CY_RET_SUCCESS == result))
            {
                result = snsId | CapSense_1_PROCESS_BASELINE_FAILED;
            }
        #else /* (CapSense_1_ENABLE == CapSense_1_TST_BSLN_DUPLICATION_EN) */
            result = CapSense_1_FtUpdateBaseline(ptrRamWdgt, ptrSnsTmp, widgetType);
        #endif /* (CapSense_1_ENABLE == CapSense_1_TST_BSLN_DUPLICATION_EN) */

        CapSense_1_DpUpdateDifferences(ptrRamWdgt, ptrSnsTmp);

        /* Move to next sensor object */
        ptrSnsTmp++;

        #if (CapSense_1_ENABLE == CapSense_1_RC_FILTER_EN)
            /* Move to the next filter history object */
            CapSense_1_INC_FLTR_OBJ_VARIANT(isProxWdgt, fltrHistV);
        #endif /* #if (CapSense_1_ENABLE == CapSense_1_RC_FILTER_EN) */
    }
    return result;
}


