swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Processing.c
/*******************************************************************************
* Function Name: CapSense_1_DpProcessCsdSensorRawCountsExt
****************************************************************************//**
*
* \brief
*   Performs customized processing of the CSD sensor raw counts.
*
* \details
*   Performs customized processing of the CSD sensor raw counts.
*
*   Note that this API updates data associated only with the sensor. It cannot be used to update
*   widget status.
*
* \param ptrFlashWdgt The pointer to the Flash widget structure.
* \param curSnsPtr    The pointer to the sensor object in RAM.
* \param fltrHistV    The pointer to the Filter History Object in RAM.
* \param mode         The bit-mask with the data processing tasks to be executed.
*   The mode parameters can take the following values:
*    - CapSense_1_PROCESS_FILTER     (0x01) Run Firmware Filter
*    - CapSense_1_PROCESS_BASELINE   (0x02) Update Baselines
*    - CapSense_1_PROCESS_DIFFCOUNTS (0x04) Update Difference Counts
*    - CapSense_1_PROCESS_CALC_NOISE (0x08) Calculate Noise (only if FW Tuning is enabled)
*    - CapSense_1_PROCESS_THRESHOLDS (0x10) Update Thresholds (only if FW Tuning is enabled)
*    - CapSense_1_PROCESS_ALL               Execute all tasks
*
* \return
*  Returns the status of the specified sensor processing operation:
*  - CY_RET_SUCCESS if operation was successfully completed;
*  - CapSense_1_PROCESS_BASELINE_FAILED if baseline processing of any
*    sensor of the specified widget failed. The result is concatenated with the index
*    of failed sensor.
*
*******************************************************************************/
uint32 CapSense_1_DpProcessCsdSensorRawCountsExt(
                CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt,
                CapSense_1_RAM_SNS_STRUCT *curSnsPtr,
                CapSense_1_PTR_FILTER_VARIANT fltrHistV,
                 uint32 mode)
{
    uint32 result = CY_RET_SUCCESS;
    uint32  widgetType;
    CapSense_1_RAM_WD_BASE_STRUCT *ptrRamWdgt;

    #if (0u != (CapSense_1_CSD_AUTOTUNE & CapSense_1_CSD_SS_TH_EN))
        SMARTSENSE_CSD_NOISE_ENVELOPE_STRUCT *ptrNoiseEnvelope;
        #if (CapSense_1_ENABLE == CapSense_1_PROXIMITY_WIDGET_EN)
            uint32  proximityThreshold;
        #endif /* (0 != CapSense_1_PROXIMITY_WIDGET_EN) */

        /* Need to specify pointer to corresponding sensor's noise-envelope object.*/
        ptrNoiseEnvelope = ptrFlashWdgt->ptr2NoiseEnvlp;
    #endif /* (0u != (CapSense_1_CSD_AUTOTUNE & CapSense_1_CSD_SS_TH_EN)) */

    widgetType = ptrFlashWdgt->wdgtType;
    ptrRamWdgt = (CapSense_1_RAM_WD_BASE_STRUCT *)ptrFlashWdgt->ptr2WdgtRam;

    #if (CapSense_1_ENABLE == CapSense_1_RC_FILTER_EN)
        if (0u != (mode & CapSense_1_PROCESS_FILTER))
        {
            CapSense_1_FtRunEnabledFiltersInternal(fltrHistV, curSnsPtr, widgetType);
            #if (CapSense_1_ALP_FILTER_EN)
                CapSense_1_ConfigRunALPInternal(fltrHistV, ptrRamWdgt, curSnsPtr, widgetType);
            #endif
        }
    #else
        (void)fltrHistV; /* This parameter is unused in such configurations */
    #endif /* #if (CapSense_1_ENABLE == CapSense_1_RC_FILTER_EN) */

    #if (0u != (CapSense_1_CSD_AUTOTUNE & CapSense_1_CSD_SS_TH_EN))
        if (0u != (mode & CapSense_1_PROCESS_CALC_NOISE))
        {
            SmartSense_RunNoiseEnvelope(curSnsPtr->raw[0u], ptrRamWdgt->sigPFC, ptrNoiseEnvelope);
        }

        if (0u != (mode & CapSense_1_PROCESS_THRESHOLDS))
        {
            CapSense_1_DpUpdateThresholds(ptrRamWdgt, ptrNoiseEnvelope, 0u);

            /* Calculate Proximity Touch Threshold in SmartSense mode based on Finger Threshold and PROX_TOUCH_COEFF */
            #if (CapSense_1_ENABLE == CapSense_1_PROXIMITY_WIDGET_EN)
                if (CapSense_1_WD_PROXIMITY_E == CapSense_1_GET_WIDGET_TYPE(ptrFlashWdgt))
                {
                    proximityThreshold = ((uint32)ptrRamWdgt->fingerTh * CapSense_1_PROX_TOUCH_COEFF) / PERCENTAGE_100;
                    if ((((1Lu) << CapSense_1_THRESHOLD_SIZE) - 1u) < proximityThreshold)
                    {
                        proximityThreshold = ((1Lu) << CapSense_1_THRESHOLD_SIZE) - 1u;
                    }
                    ((CapSense_1_RAM_WD_PROXIMITY_STRUCT *)ptrFlashWdgt->ptr2WdgtRam)->proxTouchTh =
                        (CapSense_1_THRESHOLD_TYPE)proximityThreshold;
                }
            #endif /* (0 != CapSense_1_PROXIMITY_WIDGET_EN) */
        }
    #endif /* #if (0u != (CapSense_1_CSD_AUTOTUNE & CapSense_1_CSD_SS_TH_EN)) */

    if (0u != (mode & CapSense_1_PROCESS_BASELINE))
    {
        result = CapSense_1_FtUpdateBaseline(ptrRamWdgt, curSnsPtr, widgetType);
    }

    if (0u != (mode & CapSense_1_PROCESS_DIFFCOUNTS))
    {
        CapSense_1_DpUpdateDifferences(ptrRamWdgt, curSnsPtr);
    }
    return result;
}

/*******************************************************************************
* Function Name: CapSense_1_DpProcessCsdWidgetStatus
****************************************************************************//**
*
* \brief
*  Runs the status processing of the CSD widget and updates it in the Data Structure.
*
* \details
*  This API determines the widget type and calls the appropriate low-level processing
*  function. Based on the returned results it updates the widget and sensor
*  status in the data structure. Any widget specific registers like the centroid
*  position are updated directly in the low-level processing function.
*
*  When the widget-specific processing completes this API updates the snsStatus
*  and wdgtStatus registers in the data structure. The wdgtStatus register
*  is a bitmask were each bit corresponds to the specific widget identified by
*  the widget index. When the bit is set the widget is active (touched);
*
*  The snsStatus register for CSD widgets contains status of each widget sensor
*  (active/non-active). Each bit corresponds to one sensor. In case of the
*  Proximity widget two bits are used per sensor: one for proximity status and
*  second for the touch status.
*
* \param widgetId      The widget index number.
* \param ptrFlashWdgt  The pointer to the Flash widget structure.
*
*******************************************************************************/
void CapSense_1_DpProcessCsdWidgetStatus(uint32 widgetId, CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt)
{
    uint32 sensorStatus;
    uint32 wdStatusIndex;
    uint32 wdStatusMask;
    CapSense_1_WD_TYPE_ENUM widgetType;

    widgetType = (CapSense_1_WD_TYPE_ENUM)ptrFlashWdgt->wdgtType;
    sensorStatus = CapSense_1_dsRam.snsStatus[widgetId];

    switch (widgetType)
    {
    #if (0u != CapSense_1_BUTTON_WIDGET_EN)
        case CapSense_1_WD_BUTTON_E:
            sensorStatus = CapSense_1_DpProcessButton(sensorStatus, ptrFlashWdgt);
            break;
    #endif /* #if (0u != CapSense_1_BUTTON_WIDGET_EN) */

    #if (0u != CapSense_1_SLIDER_WIDGET_EN)
        case CapSense_1_WD_LINEAR_SLIDER_E:
        case CapSense_1_WD_RADIAL_SLIDER_E:
            sensorStatus = CapSense_1_DpProcessSlider(sensorStatus, ptrFlashWdgt);
            break;
    #endif /* #if (0u != CapSense_1_SLIDER_WIDGET_EN) */

    #if (0u != CapSense_1_CSD_MATRIX_WIDGET_EN)
        case CapSense_1_WD_MATRIX_BUTTON_E:
            sensorStatus = CapSense_1_DpProcessCsdMatrix(sensorStatus, ptrFlashWdgt);
            break;
    #endif /* #if (0u != CapSense_1_CSD_MATRIX_WIDGET_EN) */

    #if (0u != CapSense_1_CSD_TOUCHPAD_WIDGET_EN)
        case CapSense_1_WD_TOUCHPAD_E:
            sensorStatus = CapSense_1_DpProcessCsdTouchpad(sensorStatus, ptrFlashWdgt);
            #if (0u != CapSense_1_BALLISTIC_MULTIPLIER_EN)
                CapSense_1_RunBallisticMultiplier(widgetId);
            #endif /* (0u != CapSense_1_BALLISTIC_MULTIPLIER_EN) */
            break;
    #endif /* #if (0u != CapSense_1_CSD_TOUCHPAD_WIDGET_EN) */

    #if (0u != CapSense_1_PROXIMITY_WIDGET_EN)
        case CapSense_1_WD_PROXIMITY_E:
            sensorStatus = CapSense_1_DpProcessProximity(sensorStatus, ptrFlashWdgt);
            break;
    #endif /* #if (0u != CapSense_1_PROXIMITY_WIDGET_EN) */

    default:
        CY_ASSERT(0 != 0);
        break;
    }

