swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Processing.c
    #if (0u != CapSense_1_POSITION_FILTER_EN)
        CapSense_1_SLIDER_POS_HISTORY_STRUCT *ptrHistory;
    #endif /* #if (0u != CapSense_1_POSITION_FILTER_EN) */

    uint32 touchIdx;
    uint32 touchCnt = 0Lu;
    uint16 newPos[CapSense_1_NUM_CENTROIDS];

    snsCnt = ptrFlashWdgt->totalNumSns;
    ptrSnsTmp = ptrFlashWdgt->ptr2SnsRam;
    ptrRamWdgt = (CapSense_1_RAM_WD_SLIDER_STRUCT *)ptrFlashWdgt->ptr2WdgtRam;
    ptrDebounceCnt = ptrFlashWdgt->ptr2DebounceArr;

    #if (0u != CapSense_1_POSITION_FILTER_EN)
        ptrHistory = ptrFlashWdgt->ptr2PosHistory;
    #endif /* #if (0u != CapSense_1_POSITION_FILTER_EN) */

    /* Calculate touch threshold based on current slider state */
    touchTh = (0Lu == currStatus ) ?
              ((uint32)ptrRamWdgt->fingerTh + ptrRamWdgt->hysteresis) :
              ((uint32)ptrRamWdgt->fingerTh - ptrRamWdgt->hysteresis);

    /* Go through all widget's sensors */
    snsMask = 1Lu;
    for (; snsCnt-- > 0Lu; )
    {
        /* Determine new potential sensor state */
        newStatus |= (ptrSnsTmp->diff > touchTh) ? snsMask : 0Lu;
        ptrSnsTmp++;

        snsMask <<= 1u;
    }

    /* If widget is active, check whether debounce is needed */
    if (0Lu != newStatus)
    {
        if (0u < (*ptrDebounceCnt))
        {
            /* Decrement debounce counter */
            (*ptrDebounceCnt)--;
        }

        if (0u == (*ptrDebounceCnt))
        {
            /* Update slider sensor state when debounce completes */
            currStatus = newStatus;
        }
    }
    else
    {
        /* Reset debounce counter */
        *ptrDebounceCnt = ptrRamWdgt->onDebounce;

        /* Clear slider sensor state */
        currStatus = 0Lu;
    }

    /* Centroid processing */
    /* If there are active sensors after debounce run the centroid algorithm */
    if (0u != currStatus)
    {
        /* Centroid always uses the lowest finger threshold (minus hysteresis)
         * to produce same results for first and all consecutive invocations */
        touchTh = (uint32)ptrRamWdgt->fingerTh - ptrRamWdgt->hysteresis;
        snsCnt = ptrFlashWdgt->totalNumSns;

        #if (0u != CapSense_1_TOTAL_DIPLEXED_SLIDERS)
            if ((0u != (ptrFlashWdgt->staticConfig & CapSense_1_DIPLEXING_MASK)))
            {
                /* Run local maximum search for duplexed slider */
                touchCnt = CapSense_1_DpFindLocalMaxDiplex(
                                ptrFlashWdgt->ptr2SnsRam, snsCnt, ptrFlashWdgt->ptr2DiplexTable, touchTh);

                /* Centroid calculation API requires double sensor count for the diplexed sliders. */
                snsCnt *= 2u;
            }
            else
            {
                /* Run local maximum search for NON-duplexed slider */
                #if (CapSense_1_ENABLE == CapSense_1_4PTS_LOCAL_MAX_EN)
                    touchCnt = CapSense_1_DpFindLocalMaxSd4pts(ptrFlashWdgt, ptrFlashWdgt->ptr2SnsRam, snsCnt, touchTh);
                #else
                    touchCnt = CapSense_1_DpFindLocalMaxSd(ptrFlashWdgt->ptr2SnsRam, snsCnt, touchTh);
                #endif
            }
        #else
            /* Run local maximum search for NON-duplexed slider */
            #if (CapSense_1_ENABLE == CapSense_1_4PTS_LOCAL_MAX_EN)
                touchCnt = CapSense_1_DpFindLocalMaxSd4pts(ptrFlashWdgt, ptrFlashWdgt->ptr2SnsRam, snsCnt, touchTh);
            #else
                touchCnt = CapSense_1_DpFindLocalMaxSd(ptrFlashWdgt->ptr2SnsRam, snsCnt, touchTh);
            #endif
        #endif /* #if (0u != CapSense_1_TOTAL_DIPLEXED_SLIDERS) */

        /* If at least one touch is detected */
        if (0u != touchCnt)
        {
            /* Determine slider type and calculate new position(s) */
            #if (0u != CapSense_1_TOTAL_LINEAR_SLIDERS)
                if ((CapSense_1_WD_TYPE_ENUM)ptrFlashWdgt->wdgtType == CapSense_1_WD_LINEAR_SLIDER_E)
                {
                    #if (CapSense_1_ENABLE == CapSense_1_SLIDER_MULT_METHOD)
                        touchCnt = CapSense_1_DpCalcLinearCentroid(newPos, (uint32)ptrFlashWdgt->xCentroidMultiplier,
                                    snsCnt, (uint32)(ptrFlashWdgt->xCentroidMultiplier >> 1));
                    #else
                        touchCnt = CapSense_1_DpCalcLinearCentroid(
                                        newPos, (uint32)ptrFlashWdgt->xCentroidMultiplier, snsCnt, 0u);
                    #endif
                    DpUpdateLinSlider(newPos, touchCnt, ptrFlashWdgt, ptrRamWdgt);
                }
            #endif /* #if (0u != CapSense_1_TOTAL_LINEAR_SLIDERS) */

            #if (0u != CapSense_1_TOTAL_RADIAL_SLIDERS)
                if ((CapSense_1_WD_TYPE_ENUM)ptrFlashWdgt->wdgtType == CapSense_1_WD_RADIAL_SLIDER_E)
                {
                    touchCnt = CapSense_1_DpCalcRadialCentroid(
                                    newPos, (uint32)ptrFlashWdgt->xCentroidMultiplier, snsCnt);
                    DpUpdateRadSlider(newPos, touchCnt, ptrFlashWdgt, ptrRamWdgt);
                }
            #endif /* #if (0u != CapSense_1_TOTAL_RADIAL_SLIDERS) */
        }
    }

    /* Clear not active position data slots */
    for (touchIdx = touchCnt; touchIdx < CapSense_1_NUM_CENTROIDS; touchIdx++)
    {
        ptrRamWdgt->position[touchIdx] = CapSense_1_SLIDER_POS_NONE;

        #if (0u != CapSense_1_POSITION_FILTER_EN)
            if (NULL != ptrHistory)
            {
                CapSense_1_InitPosFiltersSd(&ptrHistory[touchIdx], CapSense_1_SLIDER_POS_NONE);
            }
        #endif /* #if (0u != CapSense_1_POSITION_FILTER_EN) */
    }

    return currStatus;
}
#endif /* #if (0u != CapSense_1_SLIDER_WIDGET_EN) */

#if (0u != CapSense_1_TOTAL_LINEAR_SLIDERS)
/*******************************************************************************
* Function Name: DpUpdateLinSlider
****************************************************************************//**
*
* \brief
*   Updates the touch status of the Linear Slider widget.
*
* \details
*   This function updates the position data of the Linear Slider
*   in the Data Structure. Also, this function runs position filters for the
*   position data if any enabled.
*
* \param newPos       The pointer to the array with the new finger position coordinates.
* \param numTouches   The number of the coordinates in the newPos array.
* \param ptrFlashWdgt The pointer to the Flash Widget Object.
* \param ptrRamWdgt   The pointer to the RAM Widget Object.
*
*******************************************************************************/
__STATIC_INLINE void DpUpdateLinSlider(
                        const uint16 newPos[],
                        uint32 numTouches,
                        CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt,
                        CapSense_1_RAM_WD_SLIDER_STRUCT *ptrRamWdgt)
{
    uint32 touchIdx;

    #if (0u != CapSense_1_POS_AVERAGE_FILTER_EN)
        uint16 tempPosition;
    #endif /* (0u != CapSense_1_POS_AVERAGE_FILTER_EN) */

    #if (0u == CapSense_1_POSITION_FILTER_EN)
        /* This parameter is unused in such configurations */
        (void)ptrFlashWdgt;
    #else
        uint16 filteredPosition;
        /* Get bitmask with the enabled filters */
        uint32 filterConfig = (uint32)ptrFlashWdgt->staticConfig;
        /* Get pointer to the position filter history */
        CapSense_1_SLIDER_POS_HISTORY_STRUCT *ptrHistory = ptrFlashWdgt->ptr2PosHistory;
    #endif /* #if (0u == CapSense_1_POSITION_FILTER_EN) */

    #if (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN)
        ADAPTIVE_FILTER_CONTEXT_STRUCT contextAIIR;
        uint16 emptyPosition = 0;
    #endif /* (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN) */

    /* Run Filter and update the position registers with the filtered data */
    for (touchIdx = 0u; touchIdx < numTouches; touchIdx++)
    {
        #if (0u == CapSense_1_POSITION_FILTER_EN)
            /* If filters are not enabled just copy the position data */
            ptrRamWdgt->position[touchIdx] = newPos[touchIdx];
        #else
            filteredPosition = newPos[touchIdx];

            /* If there were no touch initialize the current position with new position data */
            if (ptrRamWdgt->position[touchIdx] == CapSense_1_SLIDER_POS_NONE)
            {
                CapSense_1_InitPosFiltersSd(ptrHistory, filteredPosition);
            }
            else
            {
                #if (0u != CapSense_1_POS_MEDIAN_FILTER_EN)
                    if (0u != (filterConfig & CapSense_1_POS_MEDIAN_FILTER_MASK))
                    {
                        filteredPosition = (uint16)CapSense_1_FtMedian((uint32)ptrHistory->posMedianZ2,
                                            (uint32)ptrHistory->posMedianZ1, (uint32)newPos[touchIdx]);
                        ptrHistory->posMedianZ2 = ptrHistory->posMedianZ1;
                        ptrHistory->posMedianZ1 = newPos[touchIdx];
                    }
                #endif /* #if (0u != CapSense_1_POS_MEDIAN_FILTER_EN) */

