swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Processing.c
                #if (0u != CapSense_1_POS_IIR_FILTER_EN)
                    if (0u != (filterConfig & CapSense_1_POS_IIR_FILTER_MASK))
                    {
                        filteredPosition = (uint16)CapSense_1_FtIIR1stOrder((uint32)filteredPosition, (uint32)ptrHistory->posIIR,
                                            (uint32)ptrFlashWdgt->iirFilterCoeff, 0uL);
                        ptrHistory->posIIR = filteredPosition;
                    }
                #endif /* #if (0u != CapSense_1_POS_IIR_FILTER_EN) */

                #if (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN)
                    if (0u != (filterConfig & CapSense_1_AIIR_FILTER_MASK))
                    {
                        contextAIIR.previousX = ptrHistory->posAIIR;
                        contextAIIR.previousY = emptyPosition;
                        contextAIIR.coefficient = ptrHistory->posAIIRCoeff;
                        AdaptiveFilter_Run(&ptrRamWdgt->aiirConfig, &contextAIIR, &filteredPosition, &emptyPosition);
                        ptrHistory->posAIIR = contextAIIR.previousX;
                        ptrHistory->posAIIRCoeff = contextAIIR.coefficient;
                    }
                #endif /* (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN) */

                #if (0u != CapSense_1_POS_AVERAGE_FILTER_EN)
                    if (0u != (filterConfig & CapSense_1_POS_AVERAGE_FILTER_MASK))
                    {
                        tempPosition = filteredPosition;
                        filteredPosition = (uint16)(filteredPosition + ptrHistory->posAverage) >> 1u;
                        ptrHistory->posAverage = tempPosition;
                    }
                #endif /* #if (0u != CapSense_1_POS_AVERAGE_FILTER_EN) */

                #if (0u != CapSense_1_POS_JITTER_FILTER_EN)
                    if (0u != (filterConfig & CapSense_1_POS_JITTER_FILTER_MASK))
                    {
                        filteredPosition = (uint16)CapSense_1_FtJitter((uint32)filteredPosition, (uint32)ptrHistory->posJitter);
                        ptrHistory->posJitter = filteredPosition;
                    }
                #endif /* #if (0u != CapSense_1_POS_JITTER_FILTER_EN) */
            }

            /* Update position data */
            ptrRamWdgt->position[touchIdx] = filteredPosition;

            ptrHistory = (NULL != ptrHistory) ? (ptrHistory + 1) : NULL;
        #endif /* (0u == CapSense_1_POSITION_FILTER_EN) */
    }
}
#endif /* #if (0u != CapSense_1_TOTAL_LINEAR_SLIDERS) */


#if (0u != CapSense_1_TOTAL_RADIAL_SLIDERS)
/*******************************************************************************
* Function Name: DpUpdateRadSlider
****************************************************************************//**
*
* \brief
*   Filters the Radial Slider widget position.
*
* \details
*   This function updates the position data of the radial slider
*   in the Data Structure. Also, this function runs position filters for the
*   position data if any enabled.
*
*   The filtering algorithm takes into account that it is possible that new value
*   will cross the zero position so it adjusts the position data appropriately to
*   get the correct filtered value.
*
* \param newPos[]     The pointer to the array with new centroid position data.
* \param numTouches   The number of elements in the newPos array.
* \param ptrFlashWdgt The pointer to the Flash Widget Object.
* \param ptrRamWdgt   The pointer to the RAM Widget Object .
*
*******************************************************************************/
__STATIC_INLINE void DpUpdateRadSlider(
                        const uint16 newPos[], uint32 numTouches,
                        CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt,
                        CapSense_1_RAM_WD_SLIDER_STRUCT *ptrRamWdgt)
{
    uint32 touchIdx;

    #if (0u != CapSense_1_POS_MEDIAN_FILTER_EN)
        uint16 z1;
        uint16 z2;
    #endif

    #if ((0u != CapSense_1_POS_IIR_FILTER_EN) || \
         (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN))
        uint16 delta;
    #endif

    #if (0u != CapSense_1_POS_AVERAGE_FILTER_EN)
        uint16 tempPosition;
    #endif

    #if (0u != CapSense_1_POSITION_FILTER_EN)
        uint16 filteredPosition;
        /* Get resolution. The register contains max position value, so therefore it is increased by 1 */
        uint16 tempResolution = (ptrFlashWdgt->xResolution + 1u);
        uint16 resolutionHafl = (ptrFlashWdgt->xResolution + 1u) >> 1u;
        /* Get bitmask with the enabled filters */
        uint32 filterConfig = (uint32)ptrFlashWdgt->staticConfig;
        /* Get pointer to the position filter history */
        CapSense_1_SLIDER_POS_HISTORY_STRUCT *ptrHistory = ptrFlashWdgt->ptr2PosHistory;
    #endif

    #if (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN)
        ADAPTIVE_FILTER_CONTEXT_STRUCT contextAIIR;
        uint16 emptyPosition = 0;
    #endif /* (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN) */

    /* Run Filter and update the position registers with the filtered data */
    for (touchIdx = 0u; touchIdx < numTouches; touchIdx++)
    {
        #if (0u == CapSense_1_POSITION_FILTER_EN)
            /* If filters are not enabled just copy the position data */
            ptrRamWdgt->position[touchIdx] = newPos[touchIdx];
        #else
            filteredPosition = newPos[touchIdx];

            /* If there were no touch initialize the current position with new position data */
            if (ptrRamWdgt->position[touchIdx] == CapSense_1_SLIDER_POS_NONE)
            {
                CapSense_1_InitPosFiltersSd(ptrHistory, filteredPosition);
            }
            else
            {
                /*
                 * If new position crosses zero point in one or another direction the position variable with smaller value
                 * is increased by the slider resolution. It is done for the proper filtering. For example,
                 * yResolution = 100, currPosition = 95, newPosition = 5. If no actions are taken then the average filter
                 * will give value 50 - which is wrong. But if the position values are adusted as mentioned here we will get
                 * newPosition eqaul 105 and the average will be 100. Later this filtered value will be adusted further to not
                 * cross the yResolution and it will end up with 0u - which is correct average result for the provided example.
                 */
                #if (0u != CapSense_1_POS_MEDIAN_FILTER_EN)
                    if (0u != (filterConfig & CapSense_1_POS_MEDIAN_FILTER_MASK))
                    {
                        /* Get the filter history for further zero-cross correction */
                        z1 = ptrHistory->posMedianZ1;
                        z2 = ptrHistory->posMedianZ2;

