swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Processing.c
                        /* Preserve the filter history without zero-cross correction */
                        ptrHistory->posMedianZ2 = ptrHistory->posMedianZ1;
                        ptrHistory->posMedianZ1 = filteredPosition;

                        /* Perform zero-cross correction */
                        if (z1 > (resolutionHafl + filteredPosition))
                        {
                            filteredPosition += tempResolution;
                        }
                        if (filteredPosition > (resolutionHafl + z1))
                        {
                            z1 += tempResolution;
                            z2 += tempResolution;
                        }
                        if (z2 > (resolutionHafl + z1))
                        {
                            z1 += tempResolution;
                            filteredPosition += tempResolution;
                        }
                        if (z1 > (resolutionHafl + z2))
                        {
                            z2 += tempResolution;
                        }

                        /* Perform filtering */
                        filteredPosition = CapSense_1_FtMedian((uint32)z2, (uint32)z1, filteredPosition);

                        /* Perform zero-cross correction of filtered position */
                        if (filteredPosition >= tempResolution)
                        {
                            filteredPosition -= tempResolution;
                        }
                    }
                #endif /* #if (0u != CapSense_1_POS_MEDIAN_FILTER_EN) */

                #if (0u != CapSense_1_POS_IIR_FILTER_EN)
                    if (0u != (filterConfig & CapSense_1_POS_IIR_FILTER_MASK))
                    {
                        /* Perform zero-cross correction */
                        if (ptrHistory->posIIR > (resolutionHafl + filteredPosition))
                        {
                            filteredPosition += tempResolution;
                        }
                        if (filteredPosition > (resolutionHafl + ptrHistory->posIIR))
                        {
                            ptrHistory->posIIR += tempResolution;
                        }
                        /*
                        * IIR filter can accumulate delay up to full circle and even more.
                        * This situation is not supported by the Component. If difference between
                        * between the new position and IIR filter history is bigher than
                        * CapSense_1_POS_IIR_RESET_RADIAL_SLIDER percent of circle
                        * then all enabled position filters are reset.
                        */
                        if (ptrHistory->posIIR > filteredPosition)
                        {
                            delta = ptrHistory->posIIR - filteredPosition;
                        }
                        else
                        {
                            delta = filteredPosition - ptrHistory->posIIR;
                        }
                        if (delta > ((tempResolution * CapSense_1_POS_IIR_RESET_RADIAL_SLIDER) / PERCENTAGE_100))
                        {
                            CapSense_1_InitPosFiltersSd(ptrHistory, filteredPosition);
                        }
                        else
                        {
                            /* Perform filtering */
                            filteredPosition = (uint16)CapSense_1_FtIIR1stOrder(filteredPosition, (uint32)ptrHistory->posIIR,
                                                ptrFlashWdgt->iirFilterCoeff, 0u);
                        }
                        /* Perform zero-cross correction of filtered position */
                        if (filteredPosition >= tempResolution)
                        {
                            filteredPosition -= tempResolution;
                        }
                        ptrHistory->posIIR = filteredPosition;
                    }
                #endif /* #if (0u != CapSense_1_POS_IIR_FILTER_EN) */

                #if (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN)
                    if (0u != (filterConfig & CapSense_1_AIIR_FILTER_MASK))
                    {
                        /* Perform zero-cross correction */
                        if (ptrHistory->posAIIR > (resolutionHafl + filteredPosition))
                        {
                            filteredPosition += tempResolution;
                        }
                        if (filteredPosition > (resolutionHafl + ptrHistory->posAIIR))
                        {
                            ptrHistory->posAIIR += tempResolution;
                        }
                        if (ptrHistory->posAIIR > filteredPosition)
                        {
                            delta = ptrHistory->posAIIR - filteredPosition;
                        }
                        else
                        {
                            delta = filteredPosition - ptrHistory->posAIIR;
                        }
                        if (delta > ((tempResolution * CapSense_1_POS_IIR_RESET_RADIAL_SLIDER) / PERCENTAGE_100))
                        {
                            CapSense_1_InitPosFiltersSd(ptrHistory, filteredPosition);
                        }
                        else
                        {
                            contextAIIR.previousX = ptrHistory->posAIIR;
                            contextAIIR.previousY = emptyPosition;
                            contextAIIR.coefficient = ptrHistory->posAIIRCoeff;
                            AdaptiveFilter_Run(&ptrRamWdgt->aiirConfig, &contextAIIR, &filteredPosition, &emptyPosition);
                            ptrHistory->posAIIRCoeff = contextAIIR.coefficient;
                        }
                        /* Perform zero-cross correction of filtered position */
                        if (filteredPosition >= tempResolution)
                        {
                            filteredPosition -= tempResolution;
                        }
                        ptrHistory->posAIIR = filteredPosition;
                    }
                #endif /* (0u != CapSense_1_POS_ADAPTIVE_IIR_FILTER_EN) */

                #if (0u != CapSense_1_POS_AVERAGE_FILTER_EN)
                    if (0u != (filterConfig & CapSense_1_POS_AVERAGE_FILTER_MASK))
                    {
                        tempPosition = filteredPosition;
                        /* Perform zero-cross correction */
                        if (ptrHistory->posAverage > (resolutionHafl + filteredPosition))
                        {
                            filteredPosition += tempResolution;
                        }
                        if (filteredPosition > (resolutionHafl + ptrHistory->posAverage))
                        {
                            ptrHistory->posAverage += tempResolution;
                        }
                        /* Perform filtering */
                        filteredPosition = (uint16)((filteredPosition + ptrHistory->posAverage) >> 1u);
                        /* Perform zero-cross correction of filtered position */
                        if (filteredPosition >= tempResolution)
                        {
                            filteredPosition -= tempResolution;
                        }
                        ptrHistory->posAverage = tempPosition;
                    }
                #endif /* #if (0u != CapSense_1_POS_AVERAGE_FILTER_EN) */

                #if (0u != CapSense_1_POS_JITTER_FILTER_EN)
                    if (0u != (filterConfig & CapSense_1_POS_JITTER_FILTER_MASK))
                    {
                        /* Perform zero-cross correction */
                        if (ptrHistory->posJitter > (resolutionHafl + filteredPosition))
                        {
                            filteredPosition += tempResolution;
                        }
                        if (filteredPosition > (resolutionHafl + ptrHistory->posJitter))
                        {
                            ptrHistory->posJitter += tempResolution;
                        }
                        /* Perform filtering */
                        filteredPosition = (uint16)CapSense_1_FtJitter((uint32)filteredPosition, (uint32)ptrHistory->posJitter);
                        /* Perform zero-cross correction of filtered position */
                        if (filteredPosition >= tempResolution)
                        {
                            filteredPosition -= tempResolution;
                        }
                        ptrHistory->posJitter = filteredPosition;
                    }
                #endif /* #if (0u != CapSense_1_POS_JITTER_FILTER_EN) */
            }
            /* Update position data */
            ptrRamWdgt->position[touchIdx] = filteredPosition;
            ptrHistory = (NULL != ptrHistory) ? (ptrHistory + 1) : NULL;
        #endif /* (0u == CapSense_1_POSITION_FILTER_EN) */
    }
}
#endif /* #if (0u != CapSense_1_TOTAL_RADIAL_SLIDERS) */


#if (0u != CapSense_1_CSD_MATRIX_WIDGET_EN)
/*******************************************************************************
* Function Name: CapSense_1_DpProcessCsdMatrix
****************************************************************************//**
*
* \brief
*   Processes the status of the CSD Matrix Button widget.
*
* \details
*   This API processes the status of the CSD Matrix Button widget.
*   It applies the hysteresis and debounce algorithm to each sensor value.
*
*   Then the API analyzes how many row and column sensors are active. If only
*   one per row and one per column, the API considers this as a valid touch and
*   updates the corresponding Data Structure registers with the button id and active
*   row and column sensors.
*
*   If multiple sensors are active in row or column sensors, this API sets
*   the corresponding Data Structure registers to the CapSense_1_MATRIX_POS_MULTI
*   value which indicates that it is not possible to detect the touched button id.
*
*   This API is expected to be called after each new widget scan. If it is
*   called multiple times for the same scan data, the debounce algorithm
*   will not work properly.
*
* \param currStatus   The current status of the widget sensors.
* \param ptrFlashWdgt The pointer to the Flash Widget Object.
*
* \return Returns the status of the widget's sensors. The row sensors occupy the
*         least significant bits and column sensors - the most significant bits.
*         Bit #0 - corresponds to Row Sensor #0.
*
*******************************************************************************/
uint32 CapSense_1_DpProcessCsdMatrix(uint32 currStatus, CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt)
{
    uint32 snsId;
    uint32 snsMask;
    uint32 newStatus;
    uint32 touchTh;
    uint8 * ptrDebounceCnt;
    CapSense_1_RAM_SNS_STRUCT *ptrSnsTmp;
    CapSense_1_RAM_WD_CSD_MATRIX_STRUCT *ptrRamWdgt;

    uint32 numActiveRows = 0u;
    uint32 numActiveCols = 0u;

    uint32 activeRow = CapSense_1_MATRIX_POS_NONE;
    uint32 activeCol = CapSense_1_MATRIX_POS_NONE;

