swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Processing.c
    ptrSnsTmp = ptrFlashWdgt->ptr2SnsRam;
    ptrRamWdgt = (CapSense_1_RAM_WD_CSD_MATRIX_STRUCT *)ptrFlashWdgt->ptr2WdgtRam;
    ptrDebounceCnt = ptrFlashWdgt->ptr2DebounceArr;

    /* Go through all widget's sensors */
    for (snsId = 0u; snsId < ptrFlashWdgt->totalNumSns; snsId++)
    {
        /* calculate current sensor mask */
        snsMask = 1Lu << snsId;

        /* Calculate touch threshold taking into account hysteresis and current sensor state. */
        touchTh = (0u == (currStatus & snsMask)) ?
                  ((uint32)ptrRamWdgt->fingerTh + ptrRamWdgt->hysteresis) :
                  ((uint32)ptrRamWdgt->fingerTh - ptrRamWdgt->hysteresis);

        /* Determine new potential sensor state */
        newStatus = (ptrSnsTmp->diff > touchTh) ? snsMask : 0u;

        /* Sensor state changed ? */
        if (newStatus != (currStatus & snsMask))
        {
            /* Decrement debounce counter */
            (*ptrDebounceCnt)--;
        }

        /* This piece of code has two objectives:
         * 1. Reset debounce counter if new sensor state has not changed.
         *    (It is possible that during previous processing cycles sensor state
         *     was changing which caused decrement of debounce counter.)
         * 2. Set new sensor state after successful debounce.
         */
        if ((newStatus == (currStatus & snsMask)) || (0u == (*ptrDebounceCnt)))
        {
            /* Set new sensor status */
            currStatus &= ~snsMask;
            currStatus |= newStatus;

            if (0u == newStatus)
            {
                /* Reset OFF->ON debounce counter */
                *ptrDebounceCnt = ptrRamWdgt->onDebounce;
            }
            else
            {
                /* Reset ON->OFF debounce counter */
                #if (0u != CapSense_1_OFF_DEBOUNCE_EN)
                    *ptrDebounceCnt = ptrRamWdgt->offDebounce;
                #else
                    *ptrDebounceCnt = DEFAULT_OFF_DEBOUNCE_VALUE;
                #endif /* #if (0u != CapSense_1_OFF_DEBOUNCE_EN) */
            }
        }

        /* Update information about active row/col sensors */
        if (0u != (currStatus & snsMask))
        {
            if (snsId < ptrFlashWdgt->numCols)
            {
                numActiveCols++;
                activeCol = snsId;
            }
            else
            {
                numActiveRows++;
                activeRow = snsId - ptrFlashWdgt->numCols;
            }
        }

        ptrSnsTmp++;
        ptrDebounceCnt++;
    }

    /* Update row and col registers in data structure */
    ptrRamWdgt->posCol = (numActiveCols > 1u) ? CapSense_1_MATRIX_POS_MULTI : (uint8)activeCol;
    ptrRamWdgt->posRow = (numActiveRows > 1u) ? CapSense_1_MATRIX_POS_MULTI : (uint8)activeRow;

    /* If only one row and one column sensors are active update the sensor ID register */
    if ((1u == numActiveRows) && (1u == numActiveCols))
    {
        ptrRamWdgt->posSnsId = CY_LO8((activeRow * ptrFlashWdgt->numCols) + activeCol);
    }
    else
    {
        ptrRamWdgt->posSnsId = CapSense_1_MATRIX_POS_NONE;
    }

    return currStatus;
}
#endif /* #if (0u != CapSense_1_CSD_MATRIX_WIDGET_EN) */


#if (0u != CapSense_1_CSD_TOUCHPAD_WIDGET_EN)
/*******************************************************************************
* Function Name: CapSense_1_DpProcessCsdTouchpad
****************************************************************************//**
*
* \brief
*   Processes status of the CSD Touchpad widget. This includes running
*   Centroid algorithm and updating status in the Data Structure registers.
*
* \details
*   Processes status of the CSD Touchpad widget. This includes running
*   Centroid algorithm and updating status in the Data Structure registers.
*   The status is updated in the RAM data structure.
*
* \param currStatus   The current status of the widget sensors.
* \param ptrFlashWdgt The pointer to the Flash Widget Object.
*
* \return Returns the status of the widget's sensors. The row sensors occupy the
*         least significant bits and column sensors - the most significant bits.
*         Bit #0 - corresponds to Row Sensor #0.
*
*******************************************************************************/
uint32 CapSense_1_DpProcessCsdTouchpad(uint32 currStatus, CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt)
{
    uint32 snsCnt;
    uint32 snsMask;
    uint32 touchTh;
    uint32 rowSnsMask;
    uint32 colSnsMask;
    uint32 newStatus = 0Lu;
    uint8 * ptrDebounceCnt;
    CapSense_1_RAM_SNS_STRUCT *ptrSnsTmp;
    CapSense_1_RAM_WD_CSD_TOUCHPAD_STRUCT *ptrRamWdgt;

    #if (CapSense_1_ENABLE == CapSense_1_CENTROID_3X3_CSD_EN)
        uint16 posXTmp;
        uint16 posYTmp;
        uint32 numLocalMax;
    #endif

    #if (CapSense_1_ENABLE == CapSense_1_CENTROID_5X5_CSD_EN)
        uint32 i;
        uint16 snsDiff[CapSense_1_MAX_SENSORS_PER_5X5_TOUCHPAD];
        ADVANCED_CENTROID_CONFIG_STRUCT config5X5;
        ADVANCED_CENTROID_CONTEXT_STRUCT context5X5;
        #if (0u != CapSense_1_POSITION_FILTER_EN)
            uint16 filteredX;
            uint16 filteredY;
            uint16 curPosX[ADVANCED_CENTROID_MAX_TOUCHES];
        #endif /* (0u != CapSense_1_POSITION_FILTER_EN) */
    #endif

    #if (0u != CapSense_1_POSITION_FILTER_EN)
        CapSense_1_TOUCHPAD_POS_HISTORY_STRUCT *ptrHistory;
    #endif /* (0u != CapSense_1_POSITION_FILTER_EN) */

    snsCnt = ptrFlashWdgt->totalNumSns;
    ptrSnsTmp = ptrFlashWdgt->ptr2SnsRam;
    ptrRamWdgt = (CapSense_1_RAM_WD_CSD_TOUCHPAD_STRUCT *)ptrFlashWdgt->ptr2WdgtRam;
    ptrDebounceCnt = ptrFlashWdgt->ptr2DebounceArr;

    #if (0u != CapSense_1_POSITION_FILTER_EN)
        ptrHistory = ptrFlashWdgt->ptr2PosHistory;
    #endif /* (0u != CapSense_1_POSITION_FILTER_EN) */

    /* Build masks for status word of row and column sensors */
    colSnsMask = (1Lu << ptrFlashWdgt->numCols) - 1Lu;
    rowSnsMask = (1Lu << ptrFlashWdgt->numRows) - 1Lu;
    rowSnsMask <<= ptrFlashWdgt->numCols;

