swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Processing.c
    /* Calculate touch threshold based on current touchpad state */
    touchTh = (0Lu == currStatus) ?
              ((uint32)ptrRamWdgt->fingerTh + ptrRamWdgt->hysteresis) :
              ((uint32)ptrRamWdgt->fingerTh - ptrRamWdgt->hysteresis);

    /* Go through all widget's sensors */
    snsMask = 1Lu;
    for (; snsCnt-- > 0Lu;)
    {
        /* Determine new potential sensor state */
        newStatus |= (ptrSnsTmp->diff > touchTh) ? snsMask : 0Lu;
        ptrSnsTmp++;

        snsMask <<= 1u;
    }

    /* If widget is active perform the debounce.
     * Widget is considered as active if at least one sensor is active on both axes.
     */
    if (((newStatus & rowSnsMask) > 0u) && ((newStatus & colSnsMask) > 0u))
    {
        if (0u < (*ptrDebounceCnt))
        {
            /* Decrement debounce counter */
            (*ptrDebounceCnt)--;
        }

        if (0u == (*ptrDebounceCnt))
        {
            /* Update slider sensor state when debounce completes */
            currStatus = newStatus;
        }
    }
    else
    {
        /* If widget is not active: */

        /* Reset debounce counter */
        *ptrDebounceCnt = ptrRamWdgt->onDebounce;

        /* Reset current sensor state */
        currStatus = 0Lu;

        /* Clear centroid position data for 5x5 CSD touchpad */
        #if (CapSense_1_ENABLE == CapSense_1_CENTROID_5X5_CSD_EN)
            if (0u != (ptrFlashWdgt->staticConfig & CapSense_1_CENTROID_5X5_MASK))
            {
                ptrRamWdgt->position.touchNum = 0u;
                for (i = 0u; i < ADVANCED_CENTROID_MAX_TOUCHES; i++)
                {
                    ptrRamWdgt->position.pos[i].x = ADVANCED_CENTROID_POSITION_NONE;
                    ptrRamWdgt->position.pos[i].y = ADVANCED_CENTROID_POSITION_NONE;
                    ptrRamWdgt->position.pos[i].zX = ADVANCED_CENTROID_POSITION_NONE;
                    ptrRamWdgt->position.pos[i].zY = ADVANCED_CENTROID_POSITION_NONE;

                    /* Clear position filter history data if available */
                    #if (0u != CapSense_1_POSITION_FILTER_EN)
                        if (NULL != ptrHistory)
                        {
                            CapSense_1_InitPosFiltersDd(&ptrHistory[i], CapSense_1_TOUCHPAD_POS_NONE,
                                                            CapSense_1_TOUCHPAD_POS_NONE);
                        }
                    #endif /* (0u != CapSense_1_POSITION_FILTER_EN) */
                }
            }
        #endif

        /* Clear centroid position data for 3x3 CSD touchpad */
        #if (CapSense_1_ENABLE == CapSense_1_CENTROID_3X3_CSD_EN)
            if (0u != (ptrFlashWdgt->staticConfig & CapSense_1_CENTROID_3X3_MASK))
            {
                ptrRamWdgt->posX = CapSense_1_TOUCHPAD_POS_NONE;
                ptrRamWdgt->posY = CapSense_1_TOUCHPAD_POS_NONE;

                /* Clear position filter history data if available */
                #if (0u != CapSense_1_POSITION_FILTER_EN)
                    if (NULL != ptrHistory)
                    {
                        CapSense_1_InitPosFiltersDd(ptrHistory, CapSense_1_TOUCHPAD_POS_NONE,
                                                            CapSense_1_TOUCHPAD_POS_NONE);
                    }
                #endif /* (0u != CapSense_1_POSITION_FILTER_EN) */
            }
        #endif
    }

    /* If widget is still active after debounce run the centroid algorithm */
    if (0Lu != currStatus)
    {
        /* 5x5 CSD Touchpad processing */
        #if (CapSense_1_ENABLE == CapSense_1_CENTROID_5X5_CSD_EN)
            if (0u != (ptrFlashWdgt->staticConfig & CapSense_1_CENTROID_5X5_MASK))
            {
                /* Init advanced centroid configuration structure */
                config5X5.fingerTh = (uint16)ptrRamWdgt->fingerTh;
                config5X5.penultimateTh = ptrRamWdgt->edgePenultimateTh;
                config5X5.virtualSnsTh = ptrRamWdgt->edgeVirtualSensorTh;
                config5X5.resolutionX = ptrFlashWdgt->xResolution;
                config5X5.resolutionY = ptrFlashWdgt->yResolution;
                config5X5.crossCouplingTh = ptrRamWdgt->crossCouplingPosTh;
                config5X5.snsCountX = ptrFlashWdgt->numCols;
                config5X5.snsCountY = ptrFlashWdgt->numRows;
                config5X5.edgeCorrectionEn = (uint8)((ptrFlashWdgt->staticConfig & CapSense_1_EDGE_CORRECTION_MASK) >>
                                            CapSense_1_EDGE_CORRECTION_SHIFT);
                config5X5.twoFingersEn = (uint8)((ptrFlashWdgt->staticConfig & CapSense_1_TWO_FINGER_DETECTION_MASK) >>
                                            CapSense_1_TWO_FINGER_DETECTION_SHIFT);

                /* Collect sensor differences into an array */
                ptrSnsTmp = ptrFlashWdgt->ptr2SnsRam;
                for (i = 0u; i < ptrFlashWdgt->totalNumSns; i++)
                {
                    snsDiff[i] = ptrSnsTmp->diff;
                    ptrSnsTmp++;
                }

                context5X5.ptrSns = snsDiff;
                context5X5.touch = &ptrRamWdgt->position;

                /* Save current position */
                #if (0u != CapSense_1_POSITION_FILTER_EN)
                    /* Do it for each detected position */
                    for (i = 0u; i < ADVANCED_CENTROID_MAX_TOUCHES; i++)
                    {
                        curPosX[i] = ptrRamWdgt->position.pos[i].x;
                    }
                #endif /* (0u != CapSense_1_POSITION_FILTER_EN) */

                /*
                * Calculate Advanced centroid.
                * One of the function arguments is pointer to touch position structure. It is supposed that
                * the function stores into the structure detected touches. If touch is not detected, then
                * corresponding structure fields are filled in by ADVANCED_CENTROID_POSITION_NONE.
                */
                (void)AdvancedCentroid_GetTouchCoordinates(&config5X5, &context5X5);

                /* Now filter the X and Y position data if configured */
                #if (0u != CapSense_1_POSITION_FILTER_EN)
                    /* Clear filter history for empty slots */
                    for (i = ptrRamWdgt->position.touchNum; i < ADVANCED_CENTROID_MAX_TOUCHES; i++)
                    {
                        if (NULL != ptrHistory)
                        {
                            CapSense_1_InitPosFiltersDd(&ptrHistory[i], CapSense_1_TOUCHPAD_POS_NONE,
                                                                    CapSense_1_TOUCHPAD_POS_NONE);
                        }
                    }
                    /* Filter position for detected touches */
                    for (i = 0u; i < ptrRamWdgt->position.touchNum; i++)
                    {
                        filteredX = ptrRamWdgt->position.pos[i].x;
                        filteredY = ptrRamWdgt->position.pos[i].y;

                        /* If there were no touch initialize the current position with new position data */
                        if (curPosX[i] == CapSense_1_TOUCHPAD_POS_NONE)
                        {
                            if (NULL != ptrHistory)
                            {
                                CapSense_1_InitPosFiltersDd(&ptrHistory[i], filteredX, filteredY);
                            }
                        }
                        else
                        {
                            CapSense_1_RunPosFiltersDd(ptrFlashWdgt, i, i, &filteredX, &filteredY);
                            ptrRamWdgt->position.pos[i].x = filteredX;
                            ptrRamWdgt->position.pos[i].y = filteredY;
                        }
                    }
                #endif /* (0u != CapSense_1_POSITION_FILTER_EN) */
            }
        #endif

