swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Processing.c
        /* 3x3 CSD Touchpad processing */
        #if (CapSense_1_ENABLE == CapSense_1_CENTROID_3X3_CSD_EN)
            if (0u != (ptrFlashWdgt->staticConfig & CapSense_1_CENTROID_3X3_MASK))
            {
                /* Centroid processing */
                ptrSnsTmp = ptrFlashWdgt->ptr2SnsRam;
                snsCnt = ptrFlashWdgt->totalNumSns;
                touchTh = (uint32)ptrRamWdgt->fingerTh - ptrRamWdgt->hysteresis;

                /* Run local maximum search for Column sensors of touchpad */
                #if (CapSense_1_ENABLE == CapSense_1_4PTS_LOCAL_MAX_EN)
                    numLocalMax = CapSense_1_DpFindLocalMaxSd4pts(ptrFlashWdgt, ptrSnsTmp,
                                                                            (uint32)ptrFlashWdgt->numCols, touchTh);
                #else
                    numLocalMax = CapSense_1_DpFindLocalMaxSd(ptrSnsTmp, (uint32)ptrFlashWdgt->numCols, touchTh);
                #endif

                CY_ASSERT(0u != numLocalMax); /* There must be at least one local maximum found */

                /* Verify how many local maximums are found on X axis.
                 * The CSD Touchpads support only one finger touch so we should have only one local maximum per axis.
                 * If more are found then there are multiple finger touches and it is not possible to recover their position.
                 */
                if (1u == numLocalMax)
                {
                    /* Run centroid algorithm for the X axis */
                    #if (CapSense_1_ENABLE == CapSense_1_TOUCHPAD_MULT_METHOD)
                        (void)CapSense_1_DpCalcLinearCentroid(&posXTmp, (uint32)ptrFlashWdgt->xCentroidMultiplier,
                                    (uint32)ptrFlashWdgt->numCols, (uint32)(ptrFlashWdgt->xCentroidMultiplier >> 1));
                    #else
                        (void)CapSense_1_DpCalcLinearCentroid(&posXTmp, (uint32)ptrFlashWdgt->xCentroidMultiplier,
                                    (uint32)ptrFlashWdgt->numCols, 0u);
                    #endif

                    /* Get pointer to Row RAM sensor structure array */
                    ptrSnsTmp += ptrFlashWdgt->numCols;

                    /* Run local maximum search for Row sensors of touchpad */
                    #if (CapSense_1_ENABLE == CapSense_1_4PTS_LOCAL_MAX_EN)
                        numLocalMax = CapSense_1_DpFindLocalMaxSd4pts(ptrFlashWdgt, ptrSnsTmp,
                                                                                (uint32)ptrFlashWdgt->numRows, touchTh);
                    #else
                        numLocalMax = CapSense_1_DpFindLocalMaxSd(ptrSnsTmp, (uint32)ptrFlashWdgt->numRows, touchTh);
                    #endif

                    CY_ASSERT(0u != numLocalMax); /* There must be at least one local maximum found */

                    /* Verify how many local maximums are found on Y axis.
                     * The CSD Touchpads support only one finger touch so we should have only one local maximum per axis.
                     * If more are found then it is not possible to recover finger position.
                     */
                    if (1u == numLocalMax)
                    {
                        /* Run centroid algorithm for the Y axis */
                        #if (CapSense_1_ENABLE == CapSense_1_TOUCHPAD_MULT_METHOD)
                            (void)CapSense_1_DpCalcLinearCentroid(&posYTmp, (uint32)ptrFlashWdgt->yCentroidMultiplier,
                                        (uint32)ptrFlashWdgt->numRows, (uint32)(ptrFlashWdgt->yCentroidMultiplier >> 1u));
                        #else
                            (void)CapSense_1_DpCalcLinearCentroid(&posYTmp, (uint32)ptrFlashWdgt->yCentroidMultiplier,
                                        (uint32)ptrFlashWdgt->numRows, 0u);
                        #endif

                        /* Now filter the X and Y position data if needed */
                        #if (0u != CapSense_1_POSITION_FILTER_EN)
                            if (NULL != ptrHistory)
                            {
                                /* If there were no touch initialize the current position with new position data */
                                if (ptrRamWdgt->posX == CapSense_1_TOUCHPAD_POS_NONE)
                                {
                                    CapSense_1_InitPosFiltersDd(ptrHistory, posXTmp, posYTmp);
                                }
                                else
                                {
                                    CapSense_1_RunPosFiltersDd(ptrFlashWdgt, 0u, 0u, &posXTmp, &posYTmp);
                                }
                            }
                        #endif /* (0u != CapSense_1_POSITION_FILTER_EN) */

                        ptrRamWdgt->posX = posXTmp;
                        ptrRamWdgt->posY = posYTmp;
                    }
                }
                if (numLocalMax > 1u)
                {
                    /* Clear centroid position data for 3x3 CSD touchpad */
                    ptrRamWdgt->posX = CapSense_1_TOUCHPAD_POS_NONE;
                    ptrRamWdgt->posY = CapSense_1_TOUCHPAD_POS_NONE;

                    /* Clear position filter history data if available */
                    #if (0u != CapSense_1_POSITION_FILTER_EN)
                        if (NULL != ptrHistory)
                        {
                            CapSense_1_InitPosFiltersDd(ptrHistory, CapSense_1_TOUCHPAD_POS_NONE, CapSense_1_TOUCHPAD_POS_NONE);
                        }
                    #endif /* (0u != CapSense_1_POSITION_FILTER_EN) */
                }
            }
        #endif
    }

    return currStatus;
}
#endif /* #if (0u != CapSense_1_CSD_TOUCHPAD_WIDGET_EN) */


#if (0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN)
/*******************************************************************************
* Function Name: CapSense_1_DpProcessCsxTouchpad
****************************************************************************//**
*
* \brief
*   Processes the status of the CSX Touchpad widget.
*   The process involves running the 3x3 centroid algorithm with the finger id tracker.
*
* \details
*   Processes the status of the CSX Touchpad widget.
*   The process involves running the 3x3 centroid algorithm with the finger id tracker.
*   The X/Y coordinates are updated in the RAM data structure.
*
* \param currStatus The current status of the widget sensors.
* \param ptrFlashWdgt The pointer to the Flash Widget Object.
*
* \return The number of detected touches.
*
*******************************************************************************/
uint32 CapSense_1_DpProcessCsxTouchpad(uint32 currStatus, CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt)
{
    uint32 touchCount;

