swenes/HID_Mouse_Project_PSoCsix/Staj_Mouse_HID_Project.cydsn/Generated_Source/PSoC6/CapSense_1_Processing.c
    (void)currStatus; /* Unused parameter */

    /* Check if sensors are active and located all local maxima */
    CapSense_1_DpFindLocalMaxDd(ptrFlashWdgt);

    /* Calculate centroid position for all found local maxima */
    CapSense_1_DpCalcTouchPadCentroid(ptrFlashWdgt);

    /* Identify all touches and assign them correct ID based on historical data */
    CapSense_1_DpTouchTracking(ptrFlashWdgt);

    /* Filter the position data and write it into data structure.
     * The returned value tells how many touch positions were written to the Data Structure */
    touchCount = CapSense_1_DpFilterTouchRecord(ptrFlashWdgt);

    return touchCount;
}
#endif /* #if (0u != CapSense_1_CSX_TOUCHPAD_WIDGET_EN) */

#if (0u != CapSense_1_CSX_MULTIPHASE_TX_EN)
/*******************************************************************************
* Function Name: CapSense_1_DpDeconvolution
****************************************************************************//**
*
* \brief
*   Runs deconvolution algorithm for the CSX Touchpad widgets with the enabled
*   TX Multiphase scanning.
*
* \details
*   Runs deconvolution algorithm for the CSX Touchpad widgets with the enabled
*   TX Multiphase scanning.
*
*   The deconvolution coefficients are taken from the Flash Widget Object.
*   The deconvolution results are written over the scan data stored in the
*   RAM Sensor objects.
*
* \param ptrFlashWdgt The pointer to the Flash Widget Object.
*
*******************************************************************************/
void CapSense_1_DpDeconvolution(CapSense_1_FLASH_WD_STRUCT const *ptrFlashWdgt)
{
    uint32 stNum;
    uint32 stInd;
    uint32 txNum;
    uint32 rxNum;
    uint32 freqNum;
    int32 accRaw;

    uint32 txCount = ptrFlashWdgt->numRows;
    uint32 rxCount = ptrFlashWdgt->numCols;
    const int16 *ptrSolveTable = ptrFlashWdgt->ptr2TxMultiphaseCoeff;
    CapSense_1_RAM_SNS_STRUCT *ptrSnsTmp = (CapSense_1_RAM_SNS_STRUCT *)ptrFlashWdgt->ptr2SnsRam;

    /* Run deconvolution algorithm for each touchpad column */
    for (rxNum = 0u; rxNum < rxCount; rxNum++)
    {
        /* for each scan frequency */
        for (freqNum = 0u; freqNum < CapSense_1_NUM_SCAN_FREQS; freqNum++)
        {
            /* for each RX/TX intersection */
            for (txNum = 0u; txNum < txCount; txNum++)
            {
                accRaw = 0u;

                for (stNum = 0u; stNum < txCount; stNum++)
                {
                    stInd = txCount - txNum + stNum;

                    if (stInd > (txCount - 1u))
                    {
                        stInd = stNum - txNum;
                    }

                    accRaw += (int32)ptrSnsTmp[rxNum * txCount + stNum].raw[freqNum] * (int32)ptrSolveTable[stInd];
                }

                /* Save calculated raw value to the temporary buffer. It is not possible at
                 * this stage to save it into the sensor object by overwriting the scan data
                 * because the scan data is used to calculate raw values of other sensor objects
                 */
                deconvRowData[txNum] = (accRaw >> TEMP_BUFFER_MSB_SHIFT);
            }

            for (txNum = 0u; txNum < txCount; txNum++)
            {
                ptrSnsTmp[rxNum * txCount + txNum].raw[freqNum] = deconvRowData[txNum];
            }
        }
    }
}

#endif /* #if (0u != CapSense_1_CSX_MULTIPHASE_TX_EN) */


/* [] END OF FILE */
